/***
В текущем каталоге есть 2 канала in1 in2, в которые в случайном порядке
поступают числа, которые необходимо просуммировать и вывести окончательную
сумму на экран. Сумма выводится в отдельной строке, завершающейся символом
конца строки. Признаком окончания подачи символов в каналы является закрытие
этих каналов посылающей стороной.

Подсказка: для неблокирующего чтения использовать select.
Замечание: протокол обмена по каналу текстовый, то есть числа представлены строками
***/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main(int argc, char** argv)
{

    return 0;
}